input_files/C1-high_pressure_gradient-8%_mineral_proportion/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    north_surface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    south_surface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    west_surface
    {
        type            zeroGradient;
	//	value 		uniform (1.38E-5 0 0);
	//value 		uniform (1.38E-5 0 0);
    }
    east_surface
    {
        type            zeroGradient;
    }

    top_surface
    {
		type            fixedValue;
        value           uniform (0 0 0);
    }

    bottom_surface
    {
		type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
